import java.util.ArrayList;

public class Seminar3_Lesson {
    public static void main(String[] args) {

    }

    static void task0() {
        // Даны следующие строки, cравнить их с помощью == и
        // метода equals() класса Object
        // String s1 = "hello";
        // String s2 = "hello";
        // String s3 = s1;
        // String s4 = "h" + "e" + "l" + "l" + "o";
        // String s5 = new String("hello");
        // String s6 = new String(new char[]{'h', 'e', 'l', 'l', 'o'});
    }

    static void task1() {
        // Заполнить список десятью случайными числами.
        // Отсортировать список методом sort() и вывести его на
        // экран.
    }

    static void task2() {
        // task_2.1
        // Заполнить список названиями планет Солнечной
        // системы в произвольном порядке с повторениями.
        // Вывести название каждой планеты и количество его
        // повторений в списке.

        // task_2.2
        // Пройти по списку из предыдущего задания и удалить
        // повторяющиеся элементы.

    }

    static void task3() {
        // Создать список типа ArrayList<String>.
        // Поместить в него как строки, так и целые числа.
        // Пройти по списку, найти и удалить целые числа
    }

    static void task4() {
        // Каталог товаров книжного магазина сохранен в виде двумерного
        // списка List<ArrayList<String>> так, что на 0й позиции каждого
        // внутреннего списка содержится название жанра, а на остальных
        // позициях - названия книг. Напишите метод для заполнения данной
        // структуры.
    }

}
